# Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.

def max3(num1,num2,num3):
    return max(num1,num2,num3)

print(max3(2,6,4))