# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

l = [2, 3, 4, 5, 6]
l1 = []
for i in range (int((len(l)+1)/2)):
    l1.append(l[i]*l[-1-i])
print(l1)